haymanmk/stm32f767zi_freeRTOS_first_project/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "stm32f7xx_timer_extension.h"
#include "double_buffer_mem_manage.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define VECT_TAB_OFFSET 0x00100000U // Vector Table base offset field.
#define STACK_SIZE configMINIMAL_STACK_SIZE
#define APB1_CLOCK 108000000    // Hz
#define NVIC_NUM_INTERRUPTS 110 // Number of interrupts in NVIC, 0-109

/**
 * @brief FreeRTOS Task Notify Value for updating pulse frequency
 *
 * The notify value is a 32-bit value which will be split into 2 parts:
 * - The lower 16 bits is the channel ID of the timer
 * - The higher 16 bits is the buffer ID of the double buffer
 */
// Timer Channel ID, 1, 2, 3, 4
#define TASK_NOTIFY_TIM_CHANNEL_1 0x01
#define TASK_NOTIFY_TIM_CHANNEL_2 0x02
#define TASK_NOTIFY_TIM_CHANNEL_3 0x04
#define TASK_NOTIFY_TIM_CHANNEL_4 0x08

// Double Buffer ID, 0 or 1
// The buffer ID is used to identify which buffer should be updated
#define TASK_NOTIFY_BUFFER_ID_OFFSET 16 // bit offset
#define TASK_NOTIFY_BUFFER_ID_0 0x00 << TASK_NOTIFY_BUFFER_ID_OFFSET
#define TASK_NOTIFY_BUFFER_ID_1 0x01 << TASK_NOTIFY_BUFFER_ID_OFFSET

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define COMPUTE_INCREMENT_FOR_PULSE(pulse_freq, clock_freq) ((uint32_t)((uint32_t)clock_freq / ((uint32_t)pulse_freq * 2)))

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

TIM_HandleTypeDef htim5;
DMA_HandleTypeDef hdma_tim5_ch1;
DMA_HandleTypeDef hdma_tim5_ch4_trig;

/* USER CODE BEGIN PV */
TaskHandle_t xHandleTask1 = NULL;
TaskHandle_t xHandleTask2 = NULL;
TaskHandle_t xHandleUpdatePulseData = NULL;
TaskHandle_t xHandleMainTask = NULL;

// Pulse frequency
volatile uint32_t pulseFrequency = 200;

// Double Buffer Space
static doubleBufferArray_t *preparingBufferCh1 = NULL;
static doubleBufferArray_t *preparedBufferCh1 = NULL;
static doubleBufferArray_t *preparingBufferCh4 = NULL;
static doubleBufferArray_t *preparedBufferCh4 = NULL;
volatile doubleBufferArray_t *freeBufferCh1 = NULL;
volatile doubleBufferArray_t *freeBufferCh4 = NULL;
static doubleBufferArray_t doubleBuffer1;
static doubleBufferArray_t doubleBuffer2;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM5_Init(void);
/* USER CODE BEGIN PFP */
void updateBuffer(doubleBufferArray_t *buffer, uint32_t start_index, uint32_t start_value, uint32_t increment, size_t length);
void bootloaderJumpToApp(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void vMainTask(void *pvParameters)
{
  uint32_t ulNotificationValue = 0;
  uint32_t lastCounter = 0;

  // Prepare double buffer
  uint32_t pulseIncrementCh1 = COMPUTE_INCREMENT_FOR_PULSE(pulseFrequency, APB1_CLOCK);
  preparedBufferCh1 = &doubleBuffer1;
  updateBuffer(preparedBufferCh1, 0, 0 + pulseIncrementCh1, pulseIncrementCh1, DOUBLE_BUFFER_SIZE);
  lastCounter = (*preparedBufferCh1)[DOUBLE_BUFFER_SIZE - 1];

  // add a signature in a pulse for debugging purpose
  (*preparedBufferCh1)[2] += 0.8 * pulseIncrementCh1;

  // assign array to preparingBuffer
  preparingBufferCh1 = &doubleBuffer2;

  // start timer output compare mode with DMA
  HAL_TIM_OC_Start_DMA(&htim5, TIM_CHANNEL_1, (uint32_t)preparedBufferCh1, DOUBLE_BUFFER_SIZE);

  // Reset TIM5 Counter
  __HAL_TIM_SET_COUNTER(&htim5, 0);

  // xTaskNotifyWait(0, 0xFFFFFFFF, &ulNotificationValue, portMAX_DELAY);

  for (;;)
  {
    /* do something  */
    // vLoggingPrintf("[0]Captured Value: %x\n", HAL_TIM_ReadCapturedValue(&htim5, TIM_CHANNEL_1));
    vLoggingPrintf("[0]Timer Counter: %x\n", __HAL_TIM_GET_COUNTER(&htim5));
    // prepare for next buffer
    updateBuffer(preparingBufferCh1, 0, lastCounter + pulseIncrementCh1, pulseIncrementCh1, DOUBLE_BUFFER_SIZE);
    // lastCounter = (*preparingBufferCh1)[DOUBLE_BUFFER_SIZE - 1];

    // add a signature in a pulse for debugging purpose
    (*preparingBufferCh1)[2] += 0.8 * pulseIncrementCh1;

    // Wait for the notification from the interrupt
    xTaskNotifyWait(0, 0xFFFFFFFF, &ulNotificationValue, portMAX_DELAY);

    // Check the notification value
    if (ulNotificationValue & TASK_NOTIFY_TIM_CHANNEL_1)
    {
      // swap buffer
      doubleBufferArray_t *temp = preparedBufferCh1;
      preparedBufferCh1 = preparingBufferCh1;
      preparingBufferCh1 = temp;

      // record captured value
      lastCounter = HAL_TIM_ReadCapturedValue(&htim5, TIM_CHANNEL_1);

      vLoggingPrintf("[1]Timer Counter: %x\n", __HAL_TIM_GET_COUNTER(&htim5));
      vLoggingPrintf("Captured Value (entry): %x\n", HAL_TIM_ReadCapturedValue(&htim5, TIM_CHANNEL_1));
      // Reset TIM5 Counter
      // __HAL_TIM_SET_COUNTER(&htim5, 0);

      // set capture compare value
      // __HAL_TIM_SET_COMPARE(&htim5, TIM_CHANNEL_1, 0);
      // vLoggingPrintf("Captured Value after reset: %x\n", HAL_TIM_ReadCapturedValue(&htim5, TIM_CHANNEL_1));

      // start DMA
      HAL_TIM_OC_Start_DMA(&htim5, TIM_CHANNEL_1, (uint32_t)preparedBufferCh1, DOUBLE_BUFFER_SIZE);

      // Reset TIM5 Counter
      // __HAL_TIM_SET_COUNTER(&htim5, 0);
      // print timer counter value
      vLoggingPrintf("Timer Counter: %x\n", __HAL_TIM_GET_COUNTER(&htim5));
      // print captured value
      vLoggingPrintf("Captured Value: %x\n", HAL_TIM_ReadCapturedValue(&htim5, TIM_CHANNEL_1));
    }
  }
}

