haymanmk/stm32f767zi_freeRTOS_first_project/Core/Src/main.c
  // disable all interrupts
  disable_all_interrupts();

  // clear all pending interrupts
  clear_all_pending_interrupts();

  // enable interrupts
  __enable_irq();

  // reset CONTROL register
  __set_CONTROL(0);

  // Function pointer to the address of the user application
  void (*appResetHandler)(void);

  vLoggingPrintf("Bootloader: Jump to user application\n");

  // Set the vector table offset register to the user application
  // SCB->VTOR = FLASH_BASE | VECT_TAB_OFFSET;

  // Set the stack pointer to the user application
  __set_MSP(*(uint32_t *)(FLASH_BASE | VECT_TAB_OFFSET));

  // Get the reset handler address of the user application
  uint32_t resetHandlerAddress = *(uint32_t *)(FLASH_BASE | (VECT_TAB_OFFSET + 4));
  appResetHandler = (void (*)(void))(resetHandlerAddress);

  // Jump to the user application
  appResetHandler();
}

/**
 * @brief Update double buffer with increment value
 */
void updateBuffer(doubleBufferArray_t *buffer, uint32_t start_index, uint32_t start_value, uint32_t increment, size_t length)
{
  for (uint32_t i = start_index; i < start_index + length; i++)
  {
    (*buffer)[i] = start_value + increment * (i - start_index);
  }
}

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim)
{
  if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1)
  {
    // stop DMA
    // HAL_TIM_OC_Stop_DMA(htim, TIM_CHANNEL_1);

    // stop counter
    TIM_STOP_COUNTER(htim);

    // notify main task to update pulse data
    xTaskNotifyFromISR(xHandleMainTask, TASK_NOTIFY_TIM_CHANNEL_1, eSetBits, NULL);

    // debug message, print captured value
    vLoggingPrintf("[ISR]Timer Counter: %x\n", __HAL_TIM_GET_COUNTER(htim));
  }
}

/**
 * @brief interrupt callback as DMA M0 buffer is completely transfered.
 */
void PingPongM0TransferCompleteCallback(TIM_HandleTypeDef *htim)
{
  DMA_HandleTypeDef *hdma;
  uint32_t newAddress;

  // current memory buffer in used is memory 1
  if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1)
  {
    // free node
    freeBufferCh1 = htim->hdma[TIM_DMA_ID_CC1]->Instance->M0AR;

    if (preparedBufferCh1 == NULL)
    {
      // No buffer is prepared
      // in practice, the pulse generation should be stopped
      return;
    }

    hdma = htim->hdma[TIM_DMA_ID_CC1];
    newAddress = (uint32_t)(*preparedBufferCh1);
    preparedBufferCh1 = NULL;
  }
  else if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4)
  {
    if (preparedBufferCh4 == NULL)
    {
      // No buffer is prepared
      // in practice, the pulse generation should be stopped
      return;
    }

    hdma = htim->hdma[TIM_DMA_ID_CC4];
    newAddress = (uint32_t)(*preparedBufferCh4);
    preparedBufferCh4 = NULL;
  }
  else
    return;

  // Update the memory 0 address
  if (TIM_OC_Update_DMA_Double_Buffer(hdma, newAddress, SELECT_DOUBLE_BUFFER_M0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
 * @brief interrupt callback as DMA M1 buffer is completely transfered.
 */
void PingPongM1TransferCompleteCallback(TIM_HandleTypeDef *htim)
{
  DMA_HandleTypeDef *hdma;
  uint32_t newAddress;

  // current memory buffer in used is memory 0
  if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1)
  {
    // free node
    freeBufferCh1 = htim->hdma[TIM_DMA_ID_CC1]->Instance->M1AR;

    if (preparedBufferCh1 == NULL)
    {
      // No buffer is prepared
      // in practice, the pulse generation should be stopped
      return;
    }

    hdma = htim->hdma[TIM_DMA_ID_CC1];
    newAddress = (uint32_t)(*preparedBufferCh1);
    preparedBufferCh1 = NULL;
  }
  else if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4)
  {
    if (preparedBufferCh4 == NULL)
    {
      // No buffer is prepared
      // in practice, the pulse generation should be stopped
      return;
    }

    hdma = htim->hdma[TIM_DMA_ID_CC4];
    newAddress = (uint32_t)(*preparedBufferCh4);
    preparedBufferCh4 = NULL;
  }
  else
    return;

  // Update the memory 1 address
  if (TIM_OC_Update_DMA_Double_Buffer(hdma, newAddress, SELECT_DOUBLE_BUFFER_M1) != HAL_OK)
  {
    Error_Handler();
  }
}
/* USER CODE END 4 */

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM6 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
